<details ><summary>plan for devops-dev_global_eu-central-1_common_vpc_dev3 2025-04-17 09:28:41 (UTC)</summary>
      <details ><summary>Locking successful</summary>
  Project cryptocat-org/devops-digger#devops-dev_global_eu-central-1_common_vpc_dev3 has been locked by PR #5
</details>

<details open="true"><summary>Plan output</summary>

```terraform
Terraform will perform the following actions:

  # module.vpc.aws_default_network_acl.this[0] will be created
  + resource "aws_default_network_acl" "this" {
      + arn                    = (known after apply)
      + default_network_acl_id = (known after apply)
      + id                     = (known after apply)
      + owner_id               = (known after apply)
      + tags                   = {
          + "Environment" = "global"
          + "Name"        = "global-common-eu-central-1-dev3"
          + "Namespace"   = "common"
          + "Region"      = "eu-central-1"
        }
      + tags_all               = {
          + "Environment" = "global"
          + "Name"        = "global-common-eu-central-1-dev3"
          + "Namespace"   = "common"
          + "Region"      = "eu-central-1"
        }
      + vpc_id                 = (known after apply)

      + egress {
          + action          = "allow"
          + from_port       = 0
          + ipv6_cidr_block = "::/0"
          + protocol        = "-1"
          + rule_no         = 101
          + to_port         = 0
            # (1 unchanged attribute hidden)
        }
      + egress {
          + action          = "allow"
          + cidr_block      = "0.0.0.0/0"
          + from_port       = 0
          + protocol        = "-1"
          + rule_no         = 100
          + to_port         = 0
            # (1 unchanged attribute hidden)
        }

      + ingress {
          + action          = "allow"
          + from_port       = 0
          + ipv6_cidr_block = "::/0"
          + protocol        = "-1"
          + rule_no         = 101
          + to_port         = 0
            # (1 unchanged attribute hidden)
        }
      + ingress {
          + action          = "allow"
          + cidr_block      = "0.0.0.0/0"
          + from_port       = 0
          + protocol        = "-1"
          + rule_no         = 100
          + to_port         = 0
            # (1 unchanged attribute hidden)
        }
    }

  # module.vpc.aws_default_route_table.default[0] will be created
  + resource "aws_default_route_table" "default" {
      + arn                    = (known after apply)
      + default_route_table_id = (known after apply)
      + id                     = (known after apply)
      + owner_id               = (known after apply)
      + route                  = (known after apply)
      + tags                   = {
          + "Environment" = "global"
          + "Name"        = "global-common-eu-central-1-dev3"
          + "Namespace"   = "common"
          + "Region"      = "eu-central-1"
        }
      + tags_all               = {
          + "Environment" = "global"
          + "Name"        = "global-common-eu-central-1-dev3"
          + "Namespace"   = "common"
          + "Region"      = "eu-central-1"
        }
      + vpc_id                 = (known after apply)

      + timeouts {
          + create = "5m"
          + update = "5m"
        }
    }

  # module.vpc.aws_default_security_group.this[0] will be created
  + resource "aws_default_security_group" "this" {
      + arn                    = (known after apply)
      + description            = (known after apply)
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Environment" = "global"
          + "Name"        = "global-common-eu-central-1-dev3"
          + "Namespace"   = "common"
          + "Region"      = "eu-central-1"
        }
      + tags_all               = {
          + "Environment" = "global"
          + "Name"        = "global-common-eu-central-1-dev3"
          + "Namespace"   = "common"
          + "Region"      = "eu-central-1"
        }
      + vpc_id                 = (known after apply)
    }

  # module.vpc.aws_eip.nat[0] will be created
  + resource "aws_eip" "nat" {
      + allocation_id        = (known after apply)
      + arn                  = (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = "vpc"
      + id                   = (known after apply)
      + instance             = (known after apply)
      + ipam_pool_id         = (known after apply)
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + ptr_record           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + tags                 = {
          + "Environment" = "global"
          + "Name"        = "global-common-eu-central-1-dev3"
          + "Namespace"   = "common"
          + "Region"      = "eu-central-1"
        }
      + tags_all             = {
          + "Environment" = "global"
          + "Name"        = "global-common-eu-central-1-dev3"
          + "Namespace"   = "common"
          + "Region"      = "eu-central-1"
        }
      + vpc                  = (known after apply)
    }

  # module.vpc.aws_internet_gateway.this[0] will be created
  + resource "aws_internet_gateway" "this" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + owner_id = (known after apply)
      + tags     = {
          + "Environment" = "global"
          + "Name"        = "global-common-eu-central-1-dev3"
          + "Namespace"   = "common"
          + "Region"      = "eu-central-1"
        }
      + tags_all = {
          + "Environment" = "global"
          + "Name"        = "global-common-eu-central-1-dev3"
          + "Namespace"   = "common"
          + "Region"      = "eu-central-1"
        }
      + vpc_id   = (known after apply)
    }

  # module.vpc.aws_nat_gateway.this[0] will be created
  + resource "aws_nat_gateway" "this" {
      + allocation_id                      = (known after apply)
      + association_id                     = (known after apply)
      + connectivity_type                  = "public"
      + id                                 = (known after apply)
      + network_interface_id               = (known after apply)
      + private_ip                         = (known after apply)
      + public_ip                          = (known after apply)
      + secondary_private_ip_address_count = (known after apply)
      + secondary_private_ip_addresses     = (known after apply)
      + subnet_id                          = (known after apply)
      + tags                               = {
          + "Environment" = "global"
          + "Name"        = "global-common-eu-central-1-dev3"
          + "Namespace"   = "common"
          + "Region"      = "eu-central-1"
        }
      + tags_all                           = {
          + "Environment" = "global"
          + "Name"        = "global-common-eu-central-1-dev3"
          + "Namespace"   = "common"
          + "Region"      = "eu-central-1"
        }
    }

  # module.vpc.aws_route.private_nat_gateway[0] will be created
  + resource "aws_route" "private_nat_gateway" {
      + destination_cidr_block = "0.0.0.0/0"
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + nat_gateway_id         = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)

      + timeouts {
          + create = "5m"
        }
    }

  # module.vpc.aws_route.public_internet_gateway[0] will be created
  + resource "aws_route" "public_internet_gateway" {
      + destination_cidr_block = "0.0.0.0/0"
      + gateway_id             = (known after apply)
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)

      + timeouts {
          + create = "5m"
        }
    }

  # module.vpc.aws_route_table.private[0] will be created
  + resource "aws_route_table" "private" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Environment" = "global"
          + "Name"        = "global-common-eu-central-1-dev3"
          + "Namespace"   = "common"
          + "Region"      = "eu-central-1"
        }
      + tags_all         = {
          + "Environment" = "global"
          + "Name"        = "global-common-eu-central-1-dev3"
          + "Namespace"   = "common"
          + "Region"      = "eu-central-1"
        }
      + vpc_id           = (known after apply)
    }

  # module.vpc.aws_route_table.public[0] will be created
  + resource "aws_route_table" "public" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Environment" = "global"
          + "Name"        = "global-common-eu-central-1-dev3"
          + "Namespace"   = "common"
          + "Region"      = "eu-central-1"
        }
      + tags_all         = {
          + "Environment" = "global"
          + "Name"        = "global-common-eu-central-1-dev3"
          + "Namespace"   = "common"
          + "Region"      = "eu-central-1"
        }
      + vpc_id           = (known after apply)
    }

  # module.vpc.aws_route_table_association.private[0] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.private[1] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.private[2] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.public[0] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.public[1] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.public[2] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_subnet.private[0] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "eu-central-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.10.0.0/20"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Environment"                     = "global"
          + "Name"                            = "global-common-eu-central-1-dev3"
          + "Namespace"                       = "common"
          + "Region"                          = "eu-central-1"
          + "Subnet"                          = "private"
          + "kubernetes.io/role/internal-elb" = "1"
          + "subnet-type"                     = "private"
        }
      + tags_all                                       = {
          + "Environment"                     = "global"
          + "Name"                            = "global-common-eu-central-1-dev3"
          + "Namespace"                       = "common"
          + "Region"                          = "eu-central-1"
          + "Subnet"                          = "private"
          + "kubernetes.io/role/internal-elb" = "1"
          + "subnet-type"                     = "private"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_subnet.private[1] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "eu-central-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.10.16.0/20"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Environment"                     = "global"
          + "Name"                            = "global-common-eu-central-1-dev3"
          + "Namespace"                       = "common"
          + "Region"                          = "eu-central-1"
          + "Subnet"                          = "private"
          + "kubernetes.io/role/internal-elb" = "1"
          + "subnet-type"                     = "private"
        }
      + tags_all                                       = {
          + "Environment"                     = "global"
          + "Name"                            = "global-common-eu-central-1-dev3"
          + "Namespace"                       = "common"
          + "Region"                          = "eu-central-1"
          + "Subnet"                          = "private"
          + "kubernetes.io/role/internal-elb" = "1"
          + "subnet-type"                     = "private"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_subnet.private[2] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "eu-central-1c"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.10.32.0/20"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Environment"                     = "global"
          + "Name"                            = "global-common-eu-central-1-dev3"
          + "Namespace"                       = "common"
          + "Region"                          = "eu-central-1"
          + "Subnet"                          = "private"
          + "kubernetes.io/role/internal-elb" = "1"
          + "subnet-type"                     = "private"
        }
      + tags_all                                       = {
          + "Environment"                     = "global"
          + "Name"                            = "global-common-eu-central-1-dev3"
          + "Namespace"                       = "common"
          + "Region"                          = "eu-central-1"
          + "Subnet"                          = "private"
          + "kubernetes.io/role/internal-elb" = "1"
          + "subnet-type"                     = "private"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_subnet.public[0] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "eu-central-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.10.48.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Environment"            = "global"
          + "Name"                   = "global-common-eu-central-1-dev3"
          + "Namespace"              = "common"
          + "Region"                 = "eu-central-1"
          + "Subnet"                 = "public"
          + "kubernetes.io/role/elb" = "1"
          + "subnet-type"            = "public"
        }
      + tags_all                                       = {
          + "Environment"            = "global"
          + "Name"                   = "global-common-eu-central-1-dev3"
          + "Namespace"              = "common"
          + "Region"                 = "eu-central-1"
          + "Subnet"                 = "public"
          + "kubernetes.io/role/elb" = "1"
          + "subnet-type"            = "public"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_subnet.public[1] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "eu-central-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.10.49.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Environment"            = "global"
          + "Name"                   = "global-common-eu-central-1-dev3"
          + "Namespace"              = "common"
          + "Region"                 = "eu-central-1"
          + "Subnet"                 = "public"
          + "kubernetes.io/role/elb" = "1"
          + "subnet-type"            = "public"
        }
      + tags_all                                       = {
          + "Environment"            = "global"
          + "Name"                   = "global-common-eu-central-1-dev3"
          + "Namespace"              = "common"
          + "Region"                 = "eu-central-1"
          + "Subnet"                 = "public"
          + "kubernetes.io/role/elb" = "1"
          + "subnet-type"            = "public"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_subnet.public[2] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "eu-central-1c"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.10.50.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Environment"            = "global"
          + "Name"                   = "global-common-eu-central-1-dev3"
          + "Namespace"              = "common"
          + "Region"                 = "eu-central-1"
          + "Subnet"                 = "public"
          + "kubernetes.io/role/elb" = "1"
          + "subnet-type"            = "public"
        }
      + tags_all                                       = {
          + "Environment"            = "global"
          + "Name"                   = "global-common-eu-central-1-dev3"
          + "Namespace"              = "common"
          + "Region"                 = "eu-central-1"
          + "Subnet"                 = "public"
          + "kubernetes.io/role/elb" = "1"
          + "subnet-type"            = "public"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_vpc.this[0] will be created
  + resource "aws_vpc" "this" {
      + arn                                  = (known after apply)
      + cidr_block                           = "10.10.0.0/16"
      + default_network_acl_id               = (known after apply)
      + default_route_table_id               = (known after apply)
      + default_security_group_id            = (known after apply)
      + dhcp_options_id                      = (known after apply)
      + enable_dns_hostnames                 = true
      + enable_dns_support                   = true
      + enable_network_address_usage_metrics = (known after apply)
      + id                                   = (known after apply)
      + instance_tenancy                     = "default"
      + ipv6_association_id                  = (known after apply)
      + ipv6_cidr_block                      = (known after apply)
      + ipv6_cidr_block_network_border_group = (known after apply)
      + main_route_table_id                  = (known after apply)
      + owner_id                             = (known after apply)
      + tags                                 = {
          + "Environment" = "global"
          + "Name"        = "global-common-eu-central-1-dev3"
          + "Namespace"   = "common"
          + "Region"      = "eu-central-1"
        }
      + tags_all                             = {
          + "Environment" = "global"
          + "Name"        = "global-common-eu-central-1-dev3"
          + "Namespace"   = "common"
          + "Region"      = "eu-central-1"
        }
    }

Plan: 23 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + account_id      = "052701461513"
  + private_subnets = [
      + (known after apply),
      + (known after apply),
      + (known after apply),
    ]
  + public_subnets  = [
      + (known after apply),
      + (known after apply),
      + (known after apply),
    ]
  + vpc_cidr_block  = "10.10.0.0/16"
  + vpc_id          = (known after apply)
  + vpc_name        = "global-common-eu-central-1-dev3"

```
</details>


<details ><summary>Terraform plan validation check (devops-dev_global_eu-central-1_common_vpc_dev3)</summary>
  Terraform plan validation checks succeeded :white_check_mark:
</details>

</details>